In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("records.csv")

In [3]:
df.head()

,DATE,DESCRIPTION,ACCOUNT,CREDIT,DEBIT,BALANCE,CATEGORY,SUB_CATEGORY
0,2024-05-01,GOOGLE INDIA SERVICE,SOUTH,NaN,320.90,418.27,COMMUNICATION,ALL
1,2024-05-01,HAIRUNNISA M K,SOUTH,NaN,90.00,328.27,DINING,ALL
2,2024-05-02,ARUN ARAVIND,SOUTH,NaN,77.00,251.27,DINING,ALL
3,2024-05-02,SUMESH SUGATHAN,SOUTH,NaN,6.00,245.27,DINING,ALL
4,2024-05-02,ZERODHA BROKING LIMITED,SOUTH,"11,000.00",NaN,"11,245.27",INVESTMENT,ALL

# Missing Value Mangement

In [4]:
df.columns.values

array(['DATE', 'DESCRIPTION', 'ACCOUNT', 'CREDIT', 'DEBIT', 'BALANCE',
       'CATEGORY', 'SUB_CATEGORY'], dtype=object)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 242 entries, 0 to 241
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   DATE          242 non-null    object
 1   DESCRIPTION   239 non-null    object
 2   ACCOUNT       242 non-null    object
 3   CREDIT        115 non-null    object
 4   DEBIT         128 non-null    object
 5   BALANCE       242 non-null    object
 6   CATEGORY      242 non-null    object
 7   SUB_CATEGORY  242 non-null    object
dtypes: object(8)
memory usage: 15.3+ KB

In [6]:
# Find null values
df.isnull().sum()

DATE              0
DESCRIPTION       3
ACCOUNT           0
CREDIT          127
DEBIT           114
BALANCE           0
CATEGORY          0
SUB_CATEGORY      0
dtype: int64

In [7]:
# Replace null values
df['DESCRIPTION'] = df['DESCRIPTION'].fillna('UNKNOWN')
df['CATEGORY'] = df['CATEGORY'].fillna('OTHERS')
df['SUB_CATEGORY'] = df['SUB_CATEGORY'].fillna('ALL')

In [8]:
df.isnull().sum()

DATE              0
DESCRIPTION       0
ACCOUNT           0
CREDIT          127
DEBIT           114
BALANCE           0
CATEGORY          0
SUB_CATEGORY      0
dtype: int64

In [9]:
# check and change categories
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 242 entries, 0 to 241
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   DATE          242 non-null    object
 1   DESCRIPTION   242 non-null    object
 2   ACCOUNT       242 non-null    object
 3   CREDIT        115 non-null    object
 4   DEBIT         128 non-null    object
 5   BALANCE       242 non-null    object
 6   CATEGORY      242 non-null    object
 7   SUB_CATEGORY  242 non-null    object
dtypes: object(8)
memory usage: 15.3+ KB

In [10]:
# Convert 'DATE' column to datetime format
df['DATE'] = pd.to_datetime(df['DATE'], format='%Y-%m-%d')

In [11]:
# Step 4: Convert numerical columns to float
df['CREDIT'] = df['CREDIT'].str.replace(",", "").astype(float)
df['DEBIT'] = df['DEBIT'].str.replace(",", "").astype(float)
df['BALANCE'] = df['BALANCE'].str.replace(",", "").astype(float)

In [12]:
df.head()

,DATE,DESCRIPTION,ACCOUNT,CREDIT,DEBIT,BALANCE,CATEGORY,SUB_CATEGORY
0,2024-05-01,GOOGLE INDIA SERVICE,SOUTH,NaN,320.9,418.27,COMMUNICATION,ALL
1,2024-05-01,HAIRUNNISA M K,SOUTH,NaN,90.0,328.27,DINING,ALL
2,2024-05-02,ARUN ARAVIND,SOUTH,NaN,77.0,251.27,DINING,ALL
3,2024-05-02,SUMESH SUGATHAN,SOUTH,NaN,6.0,245.27,DINING,ALL
4,2024-05-02,ZERODHA BROKING LIMITED,SOUTH,11000.0,NaN,11245.27,INVESTMENT,ALL

In [13]:
df['CREDIT']  = df['CREDIT'].fillna(0)
df['DEBIT'] = df['DEBIT'].fillna(0)

In [14]:
df.head()

,DATE,DESCRIPTION,ACCOUNT,CREDIT,DEBIT,BALANCE,CATEGORY,SUB_CATEGORY
0,2024-05-01,GOOGLE INDIA SERVICE,SOUTH,0.0,320.9,418.27,COMMUNICATION,ALL
1,2024-05-01,HAIRUNNISA M K,SOUTH,0.0,90.0,328.27,DINING,ALL
2,2024-05-02,ARUN ARAVIND,SOUTH,0.0,77.0,251.27,DINING,ALL
3,2024-05-02,SUMESH SUGATHAN,SOUTH,0.0,6.0,245.27,DINING,ALL
4,2024-05-02,ZERODHA BROKING LIMITED,SOUTH,11000.0,0.0,11245.27,INVESTMENT,ALL

In [15]:
df["CATEGORY"].value_counts()

CATEGORY
BUSINESS         96
DINING           35
TRANSFERS        20
SHOPPING         17
COMMUNICATION     8
TRAVEL            8
FINE/TAX          8
LOAN              7
GROCERY           6
SUBSCRIPTIONS     6
SERVICES          5
FAMILY            5
RENT              4
HOUSEHOLDS        4
EVENTS            3
FOOD              2
SALARY            2
INVESTMENT        2
PERSONAL CARE     1
GROCERIES         1
WORK              1
OTHERS            1
Name: count, dtype: int64

In [16]:
df["CATEGORY"] = df["CATEGORY"].replace("PERSONAL CARE", "PERSONAL_CARE")

In [17]:
df.CATEGORY.value_counts()

CATEGORY
BUSINESS         96
DINING           35
TRANSFERS        20
SHOPPING         17
COMMUNICATION     8
TRAVEL            8
FINE/TAX          8
LOAN              7
GROCERY           6
SUBSCRIPTIONS     6
SERVICES          5
FAMILY            5
RENT              4
HOUSEHOLDS        4
EVENTS            3
FOOD              2
SALARY            2
INVESTMENT        2
PERSONAL_CARE     1
GROCERIES         1
WORK              1
OTHERS            1
Name: count, dtype: int64

In [18]:
df.to_csv("records_modified.csv")

# Feature Engineering

In [19]:
df = df.sort_values(by='DATE', ignore_index=True)

In [20]:
# Create new balance features
df['BALANCE_CASH'] = 0.0
df['BALANCE_SOUTH'] = 0.0
df['BALANCE_SBI'] = 0.0

In [21]:
df.head()

,DATE,DESCRIPTION,ACCOUNT,CREDIT,DEBIT,BALANCE,CATEGORY,SUB_CATEGORY,BALANCE_CASH,BALANCE_SOUTH,BALANCE_SBI
0,2024-05-01,GOOGLE INDIA SERVICE,SOUTH,0.0,320.9,418.27,COMMUNICATION,ALL,0.0,0.0,0.0
1,2024-05-01,HAIRUNNISA M K,SOUTH,0.0,90.0,328.27,DINING,ALL,0.0,0.0,0.0
2,2024-05-01,SEETHAL,SBI,2000.0,0.0,2056.76,TRANSFERS,ALL,0.0,0.0,0.0
3,2024-05-01,INSUFFICIENT BAL POS DECLINE CHARGE,SBI,0.0,23.6,56.76,FINE/TAX,ALL,0.0,0.0,0.0
4,2024-05-02,VINSHA P,SBI,0.0,2000.0,33.16,TRANSFERS,ALL,0.0,0.0,0.0

In [22]:
# Update BALANCE_SOUTH and BALANCE_SBI based on transfers
for i in range(0, len(df)):
    if i > 0:
        df.at[i, 'BALANCE_SOUTH'] = df.at[i - 1, 'BALANCE_SOUTH']
        df.at[i, 'BALANCE_SBI'] = df.at[i - 1, 'BALANCE_SBI']
    
    if 'SOUTH' in df.at[i, 'ACCOUNT']:
        df.at[i, 'BALANCE_SOUTH'] += df.at[i, 'CREDIT'] - df.at[i, 'DEBIT']
    elif 'SBI' in df.at[i, 'ACCOUNT']:
        df.at[i, 'BALANCE_SBI'] += df.at[i, 'CREDIT'] - df.at[i, 'DEBIT']

df['TOTAL_BAL'] = df['BALANCE_CASH'] + df['BALANCE_SOUTH'] + df['BALANCE_SBI']

In [23]:
df.head(10)

,DATE,DESCRIPTION,ACCOUNT,CREDIT,DEBIT,BALANCE,CATEGORY,SUB_CATEGORY,BALANCE_CASH,BALANCE_SOUTH,BALANCE_SBI,TOTAL_BAL
0,2024-05-01,GOOGLE INDIA SERVICE,SOUTH,0.0,320.90,418.27,COMMUNICATION,ALL,0.0,-320.90,0.0,-320.90
1,2024-05-01,HAIRUNNISA M K,SOUTH,0.0,90.00,328.27,DINING,ALL,0.0,-410.90,0.0,-410.90
2,2024-05-01,SEETHAL,SBI,2000.0,0.00,2056.76,TRANSFERS,ALL,0.0,-410.90,2000.0,1589.10
3,2024-05-01,INSUFFICIENT BAL POS DECLINE CHARGE,SBI,0.0,23.60,56.76,FINE/TAX,ALL,0.0,-410.90,1976.4,1565.50
4,2024-05-02,VINSHA P,SBI,0.0,2000.00,33.16,TRANSFERS,ALL,0.0,-410.90,-23.6,-434.50
5,2024-05-02,INSUFFICIENT BAL POS DECLINE CHARGE,SBI,0.0,23.60,2033.16,FINE/TAX,ALL,0.0,-410.90,-47.2,-458.10
6,2024-05-02,VIBEESH B S,SOUTH,0.0,800.00,3389.96,EVENTS,ALL,0.0,-1210.90,-47.2,-1258.10
7,2024-05-02,PREETHIM,SBI,300.0,0.00,333.16,TRANSFERS,ALL,0.0,-1210.90,252.8,-958.10
8,2024-05-02,PREETHIMOL MP,SOUTH,0.0,50.00,10145.27,TRANSFERS,ALL,0.0,-1260.90,252.8,-1008.10
9,2024-05-02,GARAGEPRENEURS INTERNET PVT,SOUTH,0.0,5955.31,4189.96,LOAN,ALL,0.0,-7216.21,252.8,-6963.41

## Insights